airfoil/15-AoA/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
4393
(
(148.61156 -0.00056469373 0)
(148.61509 -0.0017937675 0)
(148.62277 -0.0033226936 0)
(148.63578 -0.0053536436 0)
(148.65595 -0.0080908715 0)
(148.68569 -0.011738883 0)
(148.72805 -0.016497897 0)
(148.78663 -0.022555842 0)
...
)
;

boundaryField
{
    oversetFaces
    {
        type            overset;
        coupledFringe   true;
        conservativeCorrection false;
        setHoleCellValue yes;
        holeCellValue   (0 0 0);
        value           nonuniform 0();
    }
    back
    {
        type            empty;
    }
    out
    {
        type            zeroGradient;
    }
    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    in
    {
        type            fixedValue;
        value           uniform (150 0 0);
    }
    top
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    front
    {
        type            empty;
    }
    wall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    cylinder
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
