airfoil/15-AoA/0/divFlux
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      divFlux;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
4393
(
0
-2.9661407e-09
-1.1460273e-08
-1.9005798e-08
-1.9500473e-08
-3.6066008e-08
-3.1652089e-08
-5.5545041e-08
...
)
;

boundaryField
{
    oversetFaces
    {
        type            overset;
        coupledFringe   false;
        conservativeCorrection false;
        setHoleCellValue false;
        holeCellValue   0;
        value           nonuniform 0();
    }
    back
    {
        type            empty;
    }
    out
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    in
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    front
    {
        type            empty;
    }
    wall
    {
        type            zeroGradient;
    }
    cylinder
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
