airfoil/15-AoA/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
8438
(
-0.60658129
6.9146183e-06
-0.60660325
2.1964504e-05
-0.60664394
4.0686051e-05
-0.60670949
6.5554831e-05
...
)
;

boundaryField
{
    oversetFaces
    {
        type            overset;
        value           nonuniform 0();
    }
    back
    {
        type            empty;
    }
    out
    {
        type            calculated;
        value           nonuniform List<scalar> 
49
(
0.60657437
0.60656808
0.60655642
0.6065399
0.60651998
0.606499
0.6064789
0.60646247
...
)
;
    }
    bottom
    {
        type            calculated;
        value           uniform 0;
    }
    in
    {
        type            calculated;
        value           nonuniform List<scalar> 
49
(
-0.61224495
-0.6122448
-0.61224495
-0.61224495
-0.6122448
-0.61224495
-0.61224495
-0.6122448
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 0;
    }
    front
    {
        type            empty;
    }
    wall
    {
        type            calculated;
        value           uniform 0;
    }
    cylinder
    {
        type            calculated;
        value           nonuniform List<scalar> 
156
(
0.29039325
0.15837204
0.09130635
-0.27288653
0.29763885
-0.28958826
-0.29809492
0.22894023
...
)
;
    }
    defaultFaces
    {
        type            calculated;
        value           uniform -0.0375081;
    }
}


// ************************************************************************* //
